---
title: CableTraySettings
classe: Autodesk.Revit.DB.Electrical.CableTraySettings
namespace: Autodesk.Revit.DB.Electrical
eredita: Autodesk.Revit.DB.Element
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 7
---

# CableTraySettings

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `String ConnectorSeparator { get; set; }` | `cableTraySettings.ConnectorSeparator` | String |
| `Double FittingAnnotationSize { get; set; }` | `cableTraySettings.FittingAnnotationSize` | Double |
| `Double RiseDropAnnotationSize { get; set; }` | `cableTraySettings.RiseDropAnnotationSize` | Double |
| `String SizeSeparator { get; set; }` | `cableTraySettings.SizeSeparator` | String |
| `String SizeSuffix { get; set; }` | `cableTraySettings.SizeSuffix` | String |
| `Boolean UseAnnotationScaleForSingleLineFittings { get; set; }` | `cableTraySettings.UseAnnotationScaleForSingleLineFittings` | Boolean |
| `CableTraySettings GetCableTraySettings(Document)` | `CableTraySettings.GetCableTraySettings(document)` | CableTraySettings |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```